// Створити поле довільних розмірів з м'ячем в межах поля. Нехай м’яч переміщається при натисканні на поле, туди, де був клік. Вимоги:
//
// Центр м’яча повинен збігатися з курсором миші (якщо це можливо без перетину країв поля);
// CSS-анімація бажана, але не є обов’язковою;
// М’яч у жодному разі не повинен перетинати межі поля;
// При прокручуванні сторінки нічого не повинно ламатися;
// Нотатки:
// Код повинен уміти працювати з різними розмірами м’яча та поля, не прив’язуватися до будь-яких
// фіксованих значень.
// Використовуйте властивості event.clientX/event.clientY, щоб вирахувати координати миші при кліці.